---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllGridRotationForDivisionRule
source: html/0ba940e5-16cc-3659-af69-e825e7c62e16.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllGridRotationForDivisionRule Property

"All Grid Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId AllGridRotationForDivisionRule { get; }
```